
101.79: 🧭 Immmersive CompositorLayer
cannot add handler to 0 from 1 - dropping
101.79: 🧭 Immersive secondMenuFrame
101.79: 🧭 Immersive secondMenuFrame
101.79: 👍♦️ 🤚 right.index.tip  ( 0.12, 0.14, 0.17) ∆ thumbTip => 0.033 👐phase 0 => 3 taps 0
101.80: 👐 from: right.middle.tip hash: 2014
101.80: 👍♦️ 🤚 right.middle.tip ( 0.12, 0.13, 0.19) ∆ thumbTip => 0.040 👐phase 0 => 3 taps 0
101.80: 👍♦️ 🤚 right.ring.tip   ( 0.11, 0.13, 0.22) ∆ thumbTip => 0.056 👐phase 0 => 3 taps 0
101.80: 👍♦️ 🤚 right.little.tip ( 0.11, 0.12, 0.24) ∆ thumbTip => 0.075 👐phase 0 => 3 taps 0
101.80: 👍♦️ ✋ left.index.tip   ( 0.12, 0.68,-0.24) ∆ thumbTip => 0.056 👐phase 0 => 3 taps 0
101.80: 👍♦️ ✋ left.middle.tip  ( 0.12, 0.67,-0.26) ∆ thumbTip => 0.073 👐phase 0 => 3 taps 0
101.80: 👍♦️ ✋ left.ring.tip    ( 0.11, 0.68,-0.27) ∆ thumbTip => 0.081 👐phase 0 => 3 taps 0
101.80: 👍♦️ ✋ left.little.tip  ( 0.08, 0.70,-0.28) ∆ thumbTip => 0.088 👐phase 0 => 3 taps 0
Presenting a drawable without a device anchor. This drawable won't be presented.
101.85: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.1, 0.0), (-0.0, 0.1, 1.0, 0.0), ( 0.0, 1.2, 0.0, 1.0))
102.11: 🧭 Immersive secondMenuFrame
102.11: 🧭 resizeFrame(4065,3263) clipNorm( 0.15, 0.00,  0.70, 1.00)
102.11: 🧭 immersed size(1355,1087) ports:2
102.11: 🧭 Immersive secondMenuFrame
102.11: 🧭 immersed size(1355,1087) ports:2
104.17: 👍🟢 🤚 right.index.tip  ( 0.10, 0.94,-0.25) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
104.17: 🤚👍1
104.68: 👍🔹 🤚 right.index.tip  ( 0.05, 0.88,-0.21) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
105.19: 👍🔹 🤚 right.index.tip  (-0.06, 0.90,-0.10) ∆ thumbTip => 0.015 👐phase 1 => 1 taps 0
105.69: 👍🔹 🤚 right.index.tip  (-0.09, 0.91,-0.06) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
105.87: ⚓️ origin    (( 1.0,-0.0,-0.1, 0.0), ( 0.0, 1.0, 0.0, 0.0), ( 0.1,-0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
106.07: 👍♦️ 🤚 right.index.tip  (-0.09, 0.92,-0.07) ∆ thumbTip => 0.024 👐phase 1 => 3 taps 0
107.32: 👍🟢 🤚 right.ring.tip   ( 0.07, 1.11,-0.33) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
107.82: 👍🔹 🤚 right.ring.tip   ( 0.11, 1.10,-0.48) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
108.17: 🤚👍1
108.33: 👍🔹 🤚 right.ring.tip   ( 0.11, 1.11,-0.47) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
108.84: 👍🔹 🤚 right.ring.tip   ( 0.10, 1.12,-0.46) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
109.35: 👍🔹 🤚 right.ring.tip   ( 0.09, 1.12,-0.45) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
109.82: 👍♦️ 🤚 right.ring.tip   ( 0.09, 1.13,-0.45) ∆ thumbTip => 0.022 👐phase 1 => 3 taps 0
109.87: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0, 0.0, 0.0), ( 0.0,-0.0, 1.0, 0.0), (-0.0, 1.3, 0.0, 1.0))
110.58: 👍🟢 🤚 right.ring.tip   ( 0.08, 1.13,-0.44) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
110.75: 👍♦️ 🤚 right.ring.tip   ( 0.08, 1.14,-0.44) ∆ thumbTip => 0.022 👐phase 1 => 3 taps 1
111.31: 👍🟢 🤚 right.ring.tip   ( 0.08, 1.13,-0.44) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
111.46: 👍♦️ 🤚 right.ring.tip   ( 0.08, 1.14,-0.45) ∆ thumbTip => 0.024 👐phase 1 => 3 taps 1
111.78: 👍🟢 🤚 right.ring.tip   ( 0.08, 1.12,-0.43) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 1
112.18: 🤚👍1
112.28: 👍🔹 🤚 right.ring.tip   ( 0.08, 1.12,-0.44) ∆ thumbTip => 0.016 👐phase 1 => 1 taps 1
112.78: 👍🔹 🤚 right.ring.tip   ( 0.08, 1.12,-0.44) ∆ thumbTip => 0.015 👐phase 1 => 1 taps 1
113.16: 👍♦️ 🤚 right.ring.tip   ( 0.08, 1.13,-0.44) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 0
113.90: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
114.46: 👍🟢 🤚 right.ring.tip   ( 0.07, 1.13,-0.42) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
114.97: 👍🔹 🤚 right.ring.tip   ( 0.07, 1.13,-0.43) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
115.47: 👍🔹 🤚 right.ring.tip   ( 0.07, 1.13,-0.43) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
115.98: 👍🔹 🤚 right.ring.tip   ( 0.06, 1.14,-0.40) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
116.19: 🤚👍1
116.34: 👍♦️ 🤚 right.ring.tip   ( 0.04, 1.17,-0.32) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 0
116.57: 👍🟢 🤚 right.ring.tip   ( 0.03, 1.19,-0.25) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
117.07: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.20,-0.21) ∆ thumbTip => 0.017 👐phase 1 => 1 taps 0
117.58: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.20,-0.21) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
117.90: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
118.09: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.20,-0.21) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
118.59: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.20,-0.23) ∆ thumbTip => 0.017 👐phase 1 => 1 taps 0
119.10: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.19,-0.27) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
119.61: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.17,-0.39) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
120.11: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.18,-0.45) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
120.20: 🤚👍1
120.62: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
121.12: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.50) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
121.62: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
121.93: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0,-0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
122.13: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
122.65: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
123.16: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
123.66: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
124.17: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.49) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
124.21: 🤚👍1
124.67: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.48) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
125.18: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.46) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
125.69: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.17,-0.45) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
125.95: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0, 0.0, 0.0), ( 0.0,-0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
126.20: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.17,-0.45) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
126.70: 👍🔹 🤚 right.ring.tip   ( 0.05, 1.17,-0.45) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
127.21: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.17,-0.44) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
127.36: 👍♦️ 🤚 right.ring.tip   ( 0.05, 1.18,-0.45) ∆ thumbTip => 0.024 👐phase 1 => 3 taps 0
128.57: 👍🟢 🤚 right.ring.tip   ( 0.04, 1.17,-0.44) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
128.57: 🤚👍1
129.08: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.17,-0.44) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
129.59: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.17,-0.43) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
129.96: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
130.09: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.17,-0.41) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
130.59: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.19,-0.34) ∆ thumbTip => 0.017 👐phase 1 => 1 taps 0
131.10: 👍🔹 🤚 right.ring.tip   ( 0.00, 1.18,-0.29) ∆ thumbTip => 0.008 👐phase 1 => 1 taps 0
131.60: 👍🔹 🤚 right.ring.tip   ( 0.00, 1.19,-0.24) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
132.11: 👍🔹 🤚 right.ring.tip   (-0.00, 1.19,-0.19) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
132.58: 🤚👍1
132.62: 👍🔹 🤚 right.ring.tip   (-0.00, 1.20,-0.18) ∆ thumbTip => 0.019 👐phase 1 => 1 taps 0
132.70: 👍♦️ 🤚 right.ring.tip   (-0.00, 1.20,-0.18) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 0
133.81: 👍🟢 🤚 right.ring.tip   (-0.00, 1.19,-0.19) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
133.96: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
134.31: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.18,-0.37) ∆ thumbTip => 0.015 👐phase 1 => 1 taps 0
134.82: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.14,-0.43) ∆ thumbTip => 0.007 👐phase 1 => 1 taps 0
135.33: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.15,-0.42) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
135.70: 👍♦️ 🤚 right.ring.tip   ( 0.02, 1.15,-0.42) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 0
136.99: 👍🟢 🤚 right.ring.tip   ( 0.01, 1.15,-0.40) ∆ thumbTip => 0.005 👐phase 3 => 0 taps 0
136.99: 🤚👍1
137.49: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.15,-0.40) ∆ thumbTip => 0.005 👐phase 1 => 1 taps 0
137.96: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
138.00: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.15,-0.39) ∆ thumbTip => 0.008 👐phase 1 => 1 taps 0
138.51: 👍🔹 🤚 right.ring.tip   (-0.00, 1.19,-0.33) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
139.01: 👍🔹 🤚 right.ring.tip   (-0.01, 1.20,-0.26) ∆ thumbTip => 0.008 👐phase 1 => 1 taps 0
139.51: 👍🔹 🤚 right.ring.tip   ( 0.08, 1.20,-0.30) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
139.75: 👍♦️ 🤚 right.ring.tip   ( 0.15, 1.21,-0.30) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 0
140.83: 👍🟢 🤚 right.ring.tip   ( 0.07, 1.20,-0.31) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
141.00: 🤚👍1
141.33: 👍🔹 🤚 right.ring.tip   (-0.09, 1.21,-0.33) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
141.85: 👍🔹 🤚 right.ring.tip   (-0.20, 1.20,-0.30) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
141.97: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
142.36: 👍🔹 🤚 right.ring.tip   (-0.25, 1.19,-0.28) ∆ thumbTip => 0.006 👐phase 1 => 1 taps 0
142.86: 👍🔹 🤚 right.ring.tip   (-0.21, 1.20,-0.30) ∆ thumbTip => 0.018 👐phase 1 => 1 taps 0
142.89: 👍♦️ 🤚 right.ring.tip   (-0.21, 1.20,-0.31) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 0
143.25: 👍🟢 🤚 right.ring.tip   (-0.14, 1.20,-0.32) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
143.76: 👍🔹 🤚 right.ring.tip   (-0.00, 1.20,-0.33) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
144.27: 👍🔹 🤚 right.ring.tip   ( 0.09, 1.19,-0.32) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
144.78: 👍🔹 🤚 right.ring.tip   ( 0.13, 1.18,-0.32) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
145.01: 🤚👍1
145.29: 👍🔹 🤚 right.ring.tip   ( 0.10, 1.18,-0.32) ∆ thumbTip => 0.016 👐phase 1 => 1 taps 0
145.49: 👍♦️ 🤚 right.ring.tip   ( 0.08, 1.19,-0.32) ∆ thumbTip => 0.022 👐phase 1 => 3 taps 0
145.99: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), ( 0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
146.37: 👍🟢 🤚 right.ring.tip   ( 0.03, 1.18,-0.30) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
146.55: 👍♦️ 🤚 right.ring.tip   ( 0.02, 1.19,-0.31) ∆ thumbTip => 0.022 👐phase 1 => 3 taps 1
146.76: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.17,-0.31) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 1
146.95: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.18,-0.32) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 2
147.58: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.17,-0.32) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
148.00: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.19,-0.32) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 0
148.18: 👍🟢 🤚 right.ring.tip   (-0.01, 1.17,-0.32) ∆ thumbTip => 0.008 👐phase 3 => 0 taps 0
148.69: 👍🔹 🤚 right.ring.tip   (-0.12, 1.19,-0.29) ∆ thumbTip => 0.007 👐phase 1 => 1 taps 0
149.01: 🤚👍1
149.20: 👍🔹 🤚 right.ring.tip   (-0.18, 1.18,-0.25) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
149.71: 👍🔹 🤚 right.ring.tip   (-0.14, 1.18,-0.27) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
150.01: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
150.21: 👍🔹 🤚 right.ring.tip   ( 0.04, 1.19,-0.30) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
150.49: 👍♦️ 🤚 right.ring.tip   ( 0.14, 1.20,-0.31) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 0
152.41: 👍🟢 🤚 right.ring.tip   ( 0.06, 1.19,-0.30) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
152.91: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.19,-0.29) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 0
153.02: 🤚👍1
153.42: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.19,-0.29) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
153.93: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.18,-0.29) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
154.02: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
154.43: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.19,-0.30) ∆ thumbTip => 0.017 👐phase 1 => 1 taps 0
154.46: 👍♦️ 🤚 right.ring.tip   ( 0.03, 1.19,-0.30) ∆ thumbTip => 0.025 👐phase 1 => 3 taps 0
158.03: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0, 0.0, 0.0), ( 0.0,-0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
162.04: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
162.45: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.16,-0.28) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
162.45: 🤚👍1
162.69: 👍♦️ 🤚 right.ring.tip   ( 0.02, 1.17,-0.30) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 1
163.30: 👍🟢 🤚 right.ring.tip   ( 0.01, 1.15,-0.30) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
163.39: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.17,-0.31) ∆ thumbTip => 0.031 👐phase 1 => 3 taps 1
163.68: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.15,-0.31) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 1
164.18: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.15,-0.32) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 1
164.69: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.15,-0.31) ∆ thumbTip => 0.012 👐phase 1 => 1 taps 1
164.81: 👍♦️ 🤚 right.ring.tip   ( 0.02, 1.16,-0.32) ∆ thumbTip => 0.020 👐phase 1 => 3 taps 0
165.37: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.16,-0.30) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
165.56: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.17,-0.31) ∆ thumbTip => 0.022 👐phase 1 => 3 taps 1
166.04: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
166.43: 👍🟢 🤚 right.ring.tip   ( 0.01, 1.15,-0.31) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
166.46: 🤚👍1
166.94: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.20,-0.31) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
167.44: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.26,-0.32) ∆ thumbTip => 0.006 👐phase 1 => 1 taps 0
167.96: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.27,-0.32) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
168.46: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.28,-0.32) ∆ thumbTip => 0.007 👐phase 1 => 1 taps 0
168.96: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.28,-0.31) ∆ thumbTip => 0.005 👐phase 1 => 1 taps 0
169.47: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.26,-0.31) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
169.98: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.11,-0.30) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
170.05: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
170.47: 🤚👍1
170.49: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.09,-0.29) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
170.92: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.11,-0.30) ∆ thumbTip => 0.026 👐phase 1 => 3 taps 0
171.34: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.15,-0.29) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
171.57: 👍♦️ 🤚 right.ring.tip   ( 0.03, 1.17,-0.30) ∆ thumbTip => 0.023 👐phase 1 => 3 taps 1
172.48: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.15,-0.31) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
172.98: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.18,-0.31) ∆ thumbTip => 0.008 👐phase 1 => 1 taps 0
173.48: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.26,-0.31) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
173.99: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.28,-0.31) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
174.07: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
174.47: 🤚👍1
174.49: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.25,-0.31) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
175.00: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.23,-0.30) ∆ thumbTip => 0.006 👐phase 1 => 1 taps 0
175.50: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.20,-0.29) ∆ thumbTip => 0.007 👐phase 1 => 1 taps 0
176.01: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.17,-0.30) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
176.52: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.16,-0.29) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
177.03: 👍🔹 🤚 right.ring.tip   ( 0.03, 1.15,-0.29) ∆ thumbTip => 0.010 👐phase 1 => 1 taps 0
177.53: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.14,-0.28) ∆ thumbTip => 0.011 👐phase 1 => 1 taps 0
177.60: 👍♦️ 🤚 right.ring.tip   ( 0.02, 1.15,-0.29) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 0
177.90: 👍🟢 🤚 right.ring.tip   ( 0.02, 1.16,-0.28) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
178.09: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
178.11: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.18,-0.29) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 1
178.32: 👍🟢 🤚 right.ring.tip   ( 0.01, 1.18,-0.29) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 1
178.47: 🤚👍1
178.63: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.18,-0.30) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 2
178.77: 👍🟢 🤚 right.ring.tip   ( 0.01, 1.17,-0.29) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 2
178.98: 👍♦️ 🤚 right.ring.tip   ( 0.01, 1.18,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
179.17: 👍🟢 🤚 right.ring.tip   ( 0.01, 1.17,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
179.68: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.17,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
180.18: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.16,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
180.69: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.14,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
181.20: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.12,-0.28) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
181.70: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.09,-0.28) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
182.11: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
182.21: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.08,-0.28) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
182.48: 🤚👍1
182.72: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.08,-0.28) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
183.23: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.10,-0.28) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
183.73: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.14,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
184.24: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.19,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
184.75: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.22,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
185.26: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.25,-0.31) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
185.76: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.27,-0.31) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
186.13: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
186.27: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.28,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
186.49: 🤚👍1
186.78: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.28,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
187.29: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.27,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
187.80: 👍🔹 🤚 right.ring.tip   ( 0.02, 1.24,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
188.30: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.21,-0.29) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
188.81: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.20,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
189.31: 👍🔹 🤚 right.ring.tip   ( 0.06, 1.20,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
189.82: 👍🔹 🤚 right.ring.tip   ( 0.10, 1.20,-0.31) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
190.14: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
190.33: 👍🔹 🤚 right.ring.tip   ( 0.15, 1.20,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
190.49: 🤚👍1
190.83: 👍🔹 🤚 right.ring.tip   ( 0.17, 1.19,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
191.34: 👍🔹 🤚 right.ring.tip   ( 0.17, 1.19,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
191.85: 👍🔹 🤚 right.ring.tip   ( 0.16, 1.19,-0.30) 🔳 ( -0.30… 0.30,  0.80… 1.20,  -0.50… -0.01)
192.04: 👍♦️ 🤚 right.ring.tip   ( 0.14, 1.20,-0.31) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 0
192.23: 👍🟢 🤚 right.ring.tip   ( 0.11, 1.20,-0.31) ∆ thumbTip => 0.009 👐phase 3 => 0 taps 0
192.73: 👍🔹 🤚 right.ring.tip   ( 0.01, 1.20,-0.31) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
193.23: 👍🔹 🤚 right.ring.tip   (-0.05, 1.19,-0.31) ∆ thumbTip => 0.008 👐phase 1 => 1 taps 0
193.73: 👍🔹 🤚 right.ring.tip   (-0.09, 1.19,-0.31) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
194.14: ⚓️ origin    (( 1.0,-0.0, 0.0, 0.0), ( 0.0, 1.0,-0.0, 0.0), (-0.0, 0.0, 1.0, 0.0), (-0.0, 1.2, 0.0, 1.0))
194.24: 👍🔹 🤚 right.ring.tip   (-0.13, 1.19,-0.30) ∆ thumbTip => 0.007 👐phase 1 => 1 taps 0
194.49: 🤚👍1
194.76: 👍🔹 🤚 right.ring.tip   (-0.16, 1.19,-0.30) ∆ thumbTip => 0.009 👐phase 1 => 1 taps 0
195.26: 👍🔹 🤚 right.ring.tip   (-0.17, 1.19,-0.29) ∆ thumbTip => 0.013 👐phase 1 => 1 taps 0
195.77: 👍🔹 🤚 right.ring.tip   (-0.17, 1.19,-0.29) ∆ thumbTip => 0.014 👐phase 1 => 1 taps 0
195.91: 👍♦️ 🤚 right.ring.tip   (-0.17, 1.19,-0.29) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 0
198.16: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0,-0.1, 0.0), ( 0.0, 0.1, 1.0, 0.0), (-0.0, 1.2,-0.0, 1.0))
200.72: 👍🟢 🤚 right.index.tip  ( 0.05, 0.93,-0.28) ∆ thumbTip => 0.010 👐phase 3 => 0 taps 0
200.72: 🤚👍1
200.81: 👍♦️ 🤚 right.index.tip  ( 0.05, 0.93,-0.29) ∆ thumbTip => 0.021 👐phase 1 => 3 taps 1
202.18: ⚓️ origin    (( 1.0,-0.0,-0.0, 0.0), ( 0.0, 1.0, 0.1, 0.0), ( 0.0,-0.1, 1.0, 0.0), (-0.0, 1.3, 0.0, 1.0))
206.18: ⚓️ origin    (( 1.0,-0.0,-0.1, 0.0), ( 0.0, 1.0, 0.1, 0.0), ( 0.1,-0.1, 1.0, 0.0), (-0.0, 1.3, 0.0, 1.0))
Message from debugger: killed
